===
Empty document with single line comment parses correctly
===

; Empty document with a comment

---

(document (comment))

===
Consecutive line comments correctly parse as multiple comments
===

; Empty document with a comment
; that spans two lines

---

(document (comment) (comment))

===
Comments can act as separators in records and lists
===

"key" "value" ;C1
;C2
"key" "value"

---

(document
    (record_entry
        (key (str_quoted)) (value (str_quoted)))
    (comment)
    (comment)
    (record_entry
        (key (str_quoted)) (value (str_quoted))))

===
Comments are not scanned inside quoted strings
===

";not a comment"    ";"     ; a comment

---

(document
    (record_entry
        (key (str_quoted))
        (value (str_quoted)))
    (comment))

===
Comments are parsed correctly inside records
===

"key" {
    ; Not the value
    "key" "value"
}

---

(document
    (record_entry
        (key (str_quoted))
        (value (record
            (comment)
            (record_entry
                (key (str_quoted))
                (value (str_quoted)))))))

===
Comments are parsed correctly inside lists
===

"key"   [
    ; Not the first element
    "first_element"
]

---

(document
    (record_entry
        (key (str_quoted))
        (value
            (list (comment) (str_quoted)))))
