===
Single-line multiline string value on same line as key is parsed properly
===

key >>Multiline

---

(document (record_entry (key (str_unquoted)) (value (str_multiline))))

===
Single-line multiline string following a newline is parsed properly
===

key
    >>Multiline

---

(document (record_entry (key (str_unquoted)) (value (str_multiline))))

===
Multi-line multiline string following a newline is parsed properly
===

key
    >>Multiline
    >>string

---

(document (record_entry (key (str_unquoted)) (value (str_multiline))))

===
Empty multiline string is parsed properly
===

key >>

---
(document (record_entry (key (str_unquoted)) (value (str_multiline))))

===
Multi-line empty multiline string is parsed properly
===

key >>
    >>;

---
(document (record_entry (key (str_unquoted)) (value (str_multiline))))

===
Multi-line strings parsed properly inside list (newline separated)
===

list [
    >>hello

    >>goodbye
]

---

(document
    (record_entry
        (key (str_unquoted))
        (value (list (str_multiline) (str_multiline)))))

===
Multiple multiline string keys are parsed correctly
===
key1    >>multiline
        >> string

key2    >>multiline
        >> string
---
(document
    (record_entry
        (key (str_unquoted))
        (value (str_multiline)))
    (record_entry
        (key (str_unquoted))
        (value (str_multiline))))
